## Getting Started with pandas

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series, DataFrame

### Introduction to pandas Data Structures

#### Series

In [4]:
obj = pd.Series([4, 7, -5, 3])

In [5]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
# Getting  array representation and index object of the Series via its array and index attributes, respectively
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [7]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [8]:
# Creating another Series with with an index identifying each data point with a label
obj2 = pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [10]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [11]:
# Compared with NumPy arrays in pandas you can use labels in the index when selecting single values or a set of values
obj2["a"]

-5

In [12]:
obj2["d"] = 6

In [13]:
obj2[["c", "a", "d"]]
# ["c", "a", "d"] is interpreted as a list of indices, even though it contains strings instead of integers

c    3
a   -5
d    6
dtype: int64

In [14]:
# Using NumPy functions or NumPy-like operations, such as filtering with a Boolean array, scalar multiplication, or applying math functions, will preserve the index-value link
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [15]:
# scalar multiplication
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
# Applying NumPy functions directly to the Series
import numpy as np
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
# series as a fixed-size, ordered dictionary, as it is a mapping of index values to data values
"b" in obj2

True

In [18]:
"e" in obj2

False

In [19]:
# creating a series from a dictionary by passing the dictionary to the Series constructor
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
# converting series back to a dictionary using the to_dict method
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [21]:
# Overriding the default index by passing an explicit index to the Series constructor
states = ["California", "Ohio", "Oregon", "Texas"]
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
# detecting missing data in a Series using the isna() method and notna() method
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
# Instance methods of a series
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
# A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
# name attribute of Series object and its index which integrates with other areas of pandas functionality
obj4.name = "population"
obj4.index.name = "state"
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
# altering the series index in place by assignment
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
obj.index = ["Bob", "Steve", "Jeff", "Ryan"]

In [31]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

#### DataFrame

In [32]:
# Constructing a dataframe from a dictionary of Series objects
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [33]:
frame = pd.DataFrame(data)

In [34]:
# The resulting DataFrame will have its index assigned automatically, as with Series, and the columns are placed according to the order of the keys in data (which depends on their insertion order in the dictionary)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
# For large DataFrames, the head method selects only the first five rows
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
# Similarly, tail returns the last five rows
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
# specifying a sequence of columns, makes the DataFrame’s columns arranged in that order
pd.DataFrame(data, columns=["year", "state", "pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
# passing a column that isn’t contained in the dictionary, it will appear with missing values in the result
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
# A column in a DataFrame can be retrieved as a Series either by dictionary-like notation or by using the dot attribute notation
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [41]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [42]:
# frame2[column] --- works for any column name
# frame2.column --- works only for columns with names that are valid Python identifiers and does not conflict with any of the method names in DataFrame

In [43]:
# NB: the returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.

In [44]:
# retrieving rows by position or name with the special iloc and loc attributes
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [45]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [46]:
# Columns can be modified by assignment
# eg. the empty debt column could be assigned a scalar value or an array of values
frame2["debt"] = 16.5

In [47]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [48]:
frame2["debt"] = np.arange(6.)

In [49]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [50]:
# When you are assigning lists or arrays to a column, the value’s length must match the length of the DataFrame.
# If you assign a Series, its labels will be realigned exactly to the DataFrame’s index, inserting missing values in any index values not present
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [51]:
# Assigning a column that doesn’t exist will create a new column
frame2["eastern"] = frame2.state == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [52]:
# The del keyword will delete columns like with a dictionary
# eg. I first add a new column of Boolean values where the state column equals "Ohio"

In [53]:
# using the del statement will delete a column from a DataFrame
del frame2["eastern"]

In [54]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
# Another common form of data is a nested dictionary of dictionaries
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6},
               "Nevada": {2001: 2.4, 2002: 2.9}}

In [56]:
# If the nested dictionary is passed to the DataFrame, pandas will interpret the outer dictionary keys as the columns, and the inner keys as the row indices
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [57]:
# transposing the DataFrame (swap rows and columns)with similar syntax to a Numpy array
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

##### NB: Transposing discards the column data types if the columns do not all have the same data type, so transposing and then transposing back may lose the previous type information.

In [58]:
# The keys in the inner dictionaries are combined to form the index in the result. This isn’t true if an explicit index is specified
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [59]:
# Dictionaries of Series are treated in much the same way
pdata = {"Ohio": frame3["Ohio"][:-1],
         "Nevada": frame3["Nevada"][:2]}

In [60]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [61]:
# NB: For a list of many of the things you can pass to the DataFrame constructor

In [62]:
# If a DataFrame’s index and columns have their name attributes set, these will also be displayed
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [63]:
# DataFrame does not have a name attribute.
# DataFrame’s to_numpy method returns the data contained in the DataFrame as a two-dimensional ndarray
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [64]:
# If the DataFrame’s columns are different data types, the data type of the returned array will be chosen to accommodate all of the columns
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

#### Index Objects

In [65]:
# arrays or other sequence of labels used when constructing a series or DataFrame are internally converted to an Index object
obj = pd.Series(np.arange(3), index=["a", "b", "c"])

In [66]:
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [67]:
index[1:]

Index(['b', 'c'], dtype='object')

In [68]:
# Index objects are immutable and thus can’t be modified by the user
index[1] = "d" # TypeError

TypeError: Index does not support mutable operations

In [69]:
# Immutability makes it safer to share Index objects among data structures
labels = pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [70]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [71]:
obj2.index is labels

True

In [72]:
# an index also behaves like a fixed-size set
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [73]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [74]:
"Ohio" in frame3.columns

True

In [75]:
2003 in frame3.index

False

In [76]:
# pandas Index can contain duplicate labels
pd.Index(["foo", "foo", "bar", "bar"])

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

### Essential Functionality

#### Reindexing

In [77]:
# Reindexing means to create a new object with the values rearranged to align with the new index
# Example: reindexing a Series
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [78]:
# Calling reindex on panda Series rearranges the data according to the new index, introducing missing values if any index values were not already present
obj2 = obj.reindex(["a", "b", "c", "d", "e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [79]:
# For ordered data like time series, you may want to do some interpolation or filling of values when reindexing
# The method option allows us to do this, using a method such as ffill, which forward-fills the values
obj3 = pd.Series(["blue", "purple", "yellow"], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [80]:
obj3.reindex(np.arange(6), method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [81]:
# With DataFrame, reindex can alter the (row) index, columns, or both
# When passed only a sequence, it reindexes the rows in the result
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=["a", "c", "d"],
                     columns=["Ohio", "Texas", "California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [82]:
frame2 = frame.reindex(index=["a", "b", "c", "d"])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [83]:
# columns can be reindexed with the columns keyword
states = ["Texas", "Utah", "California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [84]:
# another is to pass the new axis labels as a positional argument and then specify the axis to reindex with the axis keyword
frame.reindex(states, axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [85]:
# reindexing using the loc operator is another way to reindex a DataFrame
# This works if all of the new index labels already exist in the DataFrame (whereas reindex will insert missing data for new labels)
frame.loc[["a", "d", "c"], ["California", "Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

#### Dropping Entries from an Axis

In [86]:
# This is simple if you already have an index array or list without those entries, since you can use the reindex method or .loc-based indexing
# As that can require a bit of munging and set logic, the drop method will return a new object with the indicated value or values deleted from an axis
obj = pd.Series(np.arange(5.), index=["a", "b", "c", "d", "e"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [87]:
new_obj = obj.drop("c")
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [88]:
obj.drop(["d", "c"])

a    0.0
b    1.0
e    4.0
dtype: float64

In [89]:
# With DataFrame, index values can be deleted from either axis
# e.g
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [90]:
# Calling drop with a sequence of labels will drop values from the row labels (axis 0)
data.drop(index=["Colorado", "Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [91]:
# To drop labels from the columns, instead use the columns keyword
data.drop(columns=["two"])

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [92]:
# dropping values from the columns by passing axis=1 (which is like NumPy) or axis="columns"
data.drop("two", axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [93]:
data.drop(["two", "four"], axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

#### Indexing, Selection, and Filtering

In [94]:
# Series indexing (obj[...]) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers
obj = pd.Series(np.arange(4.), index=["a", "b", "c", "d"])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [95]:
obj["b"]

1.0

In [96]:
obj[1]

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1.0

In [97]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [98]:
obj[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [99]:
obj[[1, 3]]

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [100]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [101]:
# the preferred way to select index values is with the special loc operator because of the different treatment of integers when indexing with [].
# Regular []-based indexing will treat integers as labels if the index contains integers, so the behavior differs depending on the data type of the index
obj.loc[["b", "a", "d"]]

b    1.0
a    0.0
d    3.0
dtype: float64

In [102]:
obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])
obj1

2    1
0    2
1    3
dtype: int64

In [103]:
obj2

a    1
b    2
c    3
dtype: int64

In [104]:
obj1[[0, 1, 2]]

0    2
1    3
2    1
dtype: int64

In [105]:
obj2[[0, 1, 2]]

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\2599987575.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [106]:
# When using loc, the expression obj.loc[[0, 1, 2]] will fail when the index does not contain integers
obj2.loc[[0, 1]]

KeyError: "None of [Index([0, 1], dtype='int32')] are in the [index]"

In [107]:
# loc operator indexes exclusively with labels
# iloc operator that indexes exclusively with integers to work consistently whether or not the index contains integers
obj1.iloc[[0, 1, 2]]

2    1
0    2
1    3
dtype: int64

In [108]:
obj2.iloc[[0, 1, 2]]

a    1
b    2
c    3
dtype: int64

In [109]:
# slice can also be done with labels but works differently from normal Python slicing in that the endpoint is inclusive
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [110]:
# Assigning values using these methods modifies the corresponding section of the Series
obj2.loc["b":"c"] = 5
obj2

a    1
b    5
c    5
dtype: int64

In [111]:
# Indexing into a DataFrame retrieves one or more columns either with a single value or sequence
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [113]:
data[["three", "one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [114]:
# Indexing like above  has a few special cases.
# The first is slicing or selecting data with a Boolean array.
data[:2] # The row selection syntax data[:2] is provided as a convenience. Passing a single element or a list to the [] operator selects columns.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [115]:
data[data["three"] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
# indexing with a Boolean DataFrame, such as one produced by a scalar comparison.
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [117]:
# We can use this DataFrame to assign the value 0 to each location with the value True, like so;
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### Selection on DataFrame with loc and iloc

In [118]:
# DataFrame has special attributes loc and iloc for label-based and integer-based indexing, respectively
# Since DataFrame is two-dimensional, you can select a subset of the rows and columns with NumPy-like notation using either axis labels (loc) or integers (iloc).
# Eg. selecting a single row by label
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [119]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [120]:
# The result of selecting a single row is a Series with an index that contains the DataFrame’s column labels.
# To select multiple roles, creating a new DataFrame, pass a sequence of labels
data.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [121]:
# combining both row and column selection in loc by separating the selections with a comma
data.loc["Colorado", ["two", "three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [122]:
# using iloc to perform integer-based indexing
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [123]:
data.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [124]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [125]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [126]:
# Both indexing functions work with slices in addition to single labels or lists of labels
data.loc[:"Utah", "two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [127]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [128]:
# using Boolean arrays with loc but not iloc
data.loc[data.three >= 2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

##### Integer indexing pitfalls

In [129]:
# Working with pandas objects indexed by integers can be a stumbling block for new users since they work differently from built-in Python data structures like lists and tuples.
# For example, you might not expect the following code to generate an error
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [130]:
ser[-1]

KeyError: -1

In [131]:
# In this case, pandas could “fall back” on integer indexing, but it is difficult to do this in general without introducing subtle bugs into the user code
# Here we have an index containing 0, 1, and 2, but pandas does not want to guess what the user wants (label-based indexing or position-based)
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [132]:
# with a noninteger index, there is no such ambiguity
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])
ser2[-1]

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\454467494.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2.0

In [133]:
# If you have an axis index containing integers, data selection will always be label oriented
# if you use loc (for labels) or iloc (for integers) you will get exactly what you want
ser.iloc[-1]

2.0

In [134]:
# slicing with integers is always integer oriented
ser[:2]

0    0.0
1    1.0
dtype: float64

In [135]:
# As a result of these pitfalls, it is best to always prefer indexing with loc and iloc to avoid ambiguity.

##### Pitfalls with chained indexing

In [136]:
# loc and iloc can also be used to modify DataFrame objects in place, but doing so requires some care.
# Eg. In the example DataFrame above, we can assign to a column or row by label or integer position
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [137]:
data.iloc[2] = 5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [138]:
data.loc[data["four"] > 5] = 3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [139]:
# common gotcha for new pandas users is to chain selections when assigning, like this:
data.loc[data.three == 5]["three"] = 6

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\2392213323.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three == 5]["three"] = 6

In [140]:
# Depending on the data contents, this may print a special SettingWithCopyWarning, which warns you that you are trying to modify a temporary value (the nonempty result of data.loc[data.three == 5]) instead of the original DataFrame data, which might be what you were intending.
# Here, data was unmodified
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [141]:
# In these scenarios, the fix is to rewrite the chained assignment to use a single loc operation
data.loc[data.three == 5, "three"] = 6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

In [142]:
# NB: avoid chained indexing when doing assignments.

#### Arithmetic and Data Alignment

In [143]:
# pandas can make it much simpler to work with objects that have different indexes
# Eg. when you add objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [144]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [145]:
# Adding these yields
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [146]:
# The internal data alignment introduces missing values in the label locations that don’t overlap.
# Missing values will then propagate in further arithmetic computations.
# In the case of DataFrame, alignment is performed on both rows and columns
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"),
                  index=["Ohio", "Texas", "Colorado"])

df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])

df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [147]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [148]:
# Adding these returns a DataFrame with index and columns that are the unions of the ones in each DataFrame
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [149]:
# Since the "c" and "e" columns are not found in both DataFrame objects, they appear as missing in the result.
# The same holds for the rows with labels that are not common to both objects
# If you add DataFrame objects with no column or row labels in common, the result will contain all nulls
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})
df1

   A
0  1
1  2

In [150]:
df2

   B
0  3
1  4

In [151]:
df1 + df2

    A   B
0 NaN NaN
1 NaN NaN

##### Arithmetic methods with fill values

In [152]:
# In arithmetic operations between differently indexed objects, you might want to fill with a special value, like 0, when an axis label is found in one object but not the other.
# eg. where we set a particular value to NA (null) by assigning np.nan to it
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))

df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))

df2.loc[1, "b"] = np.nan

df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [153]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [154]:
# Adding these results in missing values in the locations that don’t overlap
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [155]:
# Using the add method on df1, I pass df2 and an argument to fill_value, which substitutes the passed value for any missing values in the operation
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [156]:
# The fill_value argument can be used with any arithmetic method, such as sub, mul, and div
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [157]:
# using the rdiv method, which is the reverse of div, will also work
# This is equivalent to 1 / df1, but the division is done with 1
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [158]:
# when reindexing a Series or DataFrame, you can also specify a different fill value
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

##### Operations between DataFrame and Series

In [159]:
# As with NumPy arrays of different dimensions, arithmetic between DataFrame and Series is also defined.
# First, as a motivating example, consider the difference between a two-dimensional array and one of its rows
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [160]:
arr[0]

array([0., 1., 2., 3.])

In [161]:
arr - arr[0] # When we subtract arr[0] from arr, the subtraction is performed once for each row. This is referred to as broadcasting

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [162]:
# Operations between a DataFrame and a Series are similar
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [163]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [164]:
# By default, arithmetic between DataFrame and Series matches the index of the Series on the columns of the DataFrame, broadcasting down the rows
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [165]:
# If an index value is not found in either the DataFrame’s columns or the Series’s index, the objects will be reindexed to form the union
series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [166]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [167]:
# broadcasting over the columns, matching on the rows, you have to use one of the arithmetic methods and specify to match over the index
# Example,
series3 = frame["d"]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [168]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [169]:
frame.sub(series3, axis="index")

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [170]:
# The axis that you pass is the axis to match on.
# In this case we mean to match on the DataFrame’s row index (axis="index") and broadcast across the columns.

#### Function Application and Mapping

In [171]:
# NumPy ufuncs (element-wise array methods) also work with pandas objects
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

frame

               b         d         e
Utah    1.102853 -0.578149 -0.052789
Ohio    0.144051  2.572439  0.376059
Texas   1.144615  0.582441  1.514235
Oregon  1.021140 -0.078996  0.128272

In [172]:
np.abs(frame)

               b         d         e
Utah    1.102853  0.578149  0.052789
Ohio    0.144051  2.572439  0.376059
Texas   1.144615  0.582441  1.514235
Oregon  1.021140  0.078996  0.128272

In [173]:
# Another frequent operation is applying a function on one-dimensional arrays to each column or row.
# DataFrame’s apply method does exactly this.
def f1(x):
    return x.max() - x.min()
frame.apply(f1)

# function (f) - computes the difference between the maximum and minimum of a Series and is invoked once on each column in frame.
# The result is a Series having the columns of frame as its index.

b    1.000564
d    3.150588
e    1.567024
dtype: float64

In [174]:
# If you pass axis="columns" to apply, the function will be invoked once per row instead.
# apply across the columns
frame.apply(f1, axis="columns")

Utah      1.681002
Ohio      2.428389
Texas     0.931794
Oregon    1.100136
dtype: float64

In [175]:
# The function passed to apply need not return a scalar value; it can also return a Series with multiple values
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])
frame.apply(f2)

            b         d         e
min  0.144051 -0.578149 -0.052789
max  1.144615  2.572439  1.514235

In [176]:
# If you wanted to compute a formatted string from each floating-point value in frame. You can do this with applymap
def my_format(x):
    return f"{x:.2f}"
frame.applymap(my_format)

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\974936872.py:4: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format)

           b      d      e
Utah    1.10  -0.58  -0.05
Ohio    0.14   2.57   0.38
Texas   1.14   0.58   1.51
Oregon  1.02  -0.08   0.13

In [177]:
# The reason for the name applymap is that Series has a map method for applying an element-wise function
frame["e"].map(my_format)

Utah      -0.05
Ohio       0.38
Texas      1.51
Oregon     0.13
Name: e, dtype: object

#### Sorting and Ranking

In [178]:
# Sorting a dataset by some criterion is another important built-in operation.
# To sort lexicographically by row or column label, use the sort_index method, which returns a new, sorted object
obj = pd.Series(np.arange(4), index=["d", "a", "b", "c"])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [179]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [180]:
# With a DataFrame, you can sort by index on either axis
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [181]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [182]:
frame.sort_index(axis="columns")

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [183]:
# The data is sorted in ascending order by default but can be sorted in descending order, too
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [184]:
# To sort a Series by its values, use its sort_values method
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [185]:
# Any missing values are sorted to the end of the Series by default
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [186]:
# Missing values can be sorted to the start instead by using the na_position option:
obj.sort_values(na_position="first")

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [187]:
# When sorting a DataFrame, you can use the data in one or more columns as the sort keys.
# To do so, pass one or more column names to sort_values
frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [188]:
frame.sort_values("b")

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [189]:
# To sort by multiple columns, pass a list of names:
frame.sort_values(["a", "b"])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [190]:
# Ranking assigns ranks from one through the number of valid data points in an array, starting from the lowest value.
# The rank methods for Series and DataFrame are the place to look; by default, rank breaks ties by assigning each group the mean rank
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [191]:
# Ranks can also be assigned according to the order in which they’re observed in the data
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [192]:
# instead of using the average rank 6.5 for the entries 0 and 2, they instead have been set to 6 and 7 because label 0 precedes label 2 in the data.
# You can rank in descending order, too
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [193]:
# DataFrame can compute ranks over the rows or the columns:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                       "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [194]:
frame.rank(axis="columns")

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

#### Axis Indexes with Duplicate Labels

In [195]:
# many pandas functions (like reindex) require that the labels be unique, it’s not mandatory.
# considering a small Series with duplicate indices
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [196]:
# The is_unique property of the index can tell you whether or not its labels are unique
obj.index.is_unique

False

In [197]:
# Data selection is one of the main things that behaves differently with duplicates.
# Indexing a label with multiple entries returns a Series, while single entries return a scalar value
obj["a"]

a    0
a    1
dtype: int32

In [198]:
obj["c"]

4

In [199]:
# This can make your code more complicated, as the output type from indexing can vary based on whether or not a label is repeated.
# The same logic extends to indexing rows (or columns) in a DataFrame
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.450388 -0.300078  0.090869
a -0.612770  0.554983 -1.027944
b -1.267583 -0.248943  0.953427
b -0.787452 -0.801044 -0.030257
c  0.372842 -0.199873 -0.795377

In [200]:
df.loc["b"]

          0         1         2
b -1.267583 -0.248943  0.953427
b -0.787452 -0.801044 -0.030257

In [201]:
df.loc["c"]

0    0.372842
1   -0.199873
2   -0.795377
Name: c, dtype: float64

### Summarizing and Computing Descriptive Statistics

In [202]:
# Most of mathematical and statistical methods fall into the category of reductions or summary statistics, methods that extract a single value (like the sum or mean) from a Series, or a Series of values from the rows or columns of a DataFrame.
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [203]:
# Calling DataFrame’s sum method returns a Series containing column sums
df.sum()

one    9.25
two   -5.80
dtype: float64

In [204]:
# Passing axis="columns" or axis=1 sums across the columns instead
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [205]:
# When an entire row or column contains all NA values, the sum is 0, whereas if any value is not NA, then the result is NA.
# This can be disabled with the skipna option, in which case any NA value in a row or column names the corresponding result NA
df.sum(axis="index", skipna=False)

one   NaN
two   NaN
dtype: float64

In [206]:
df.sum(axis="columns", skipna=False)

a     NaN
b    2.60
c     NaN
d   -0.55
dtype: float64

In [207]:
# Some aggregations, like mean, require at least one non-NA value to yield a value result, so here we have
df.mean(axis="columns")

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [208]:
# Some methods, like idxmin and idxmax, return indirect statistics, like the index value where the minimum or maximum values are attained
df.idxmax()

one    b
two    d
dtype: object

In [209]:
# Other methods are accumulations
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [210]:
# Some methods are neither reductions nor accumulations. describe is one such example, producing multiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [211]:
# On nonnumeric data, describe produces alternative summary statistics
obj = pd.Series(["a", "a", "b", "c"] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

#### Correlation and Covariance

In [214]:
# Some summary statistics, like correlation and covariance, are computed from pairs of arguments.
# Let’s consider some DataFrames of stock prices and volumes originally obtained from Yahoo! Finance and available in binary Python pickle files you can find in the accompanying datasets for the book:
price = pd.read_pickle("datasets/yahoo_price.pkl")
volume = pd.read_pickle("datasets/yahoo_volume.pkl")

In [215]:
returns = price.pct_change()

In [216]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [217]:
# The corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series.
# Relatedly, cov computes the covariance
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [218]:
returns["MSFT"].cov(returns["IBM"])

8.870655479703546e-05

In [219]:
# Since MSFT is a valid Python variable name, we can also select these columns using more concise syntax
returns["MSFT"].corr(returns["IBM"])

0.4997636114415114

In [220]:
# DataFrame’s corr and cov methods, on the other hand, return a full correlation or covariance matrix as a DataFrame, respectively
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [221]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [222]:
# Using DataFrame’s corrwith method, you can compute pair-wise correlations between a DataFrame’s columns or rows with another Series or DataFrame
# Passing a Series returns a Series with the correlation value computed for each column
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [223]:
# Passing a DataFrame computes the correlations of matching column names.
# computing correlations of percent changes with volume
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [224]:
# Passing axis="columns" does things row-by-row instead. In all cases, the data points are aligned by label before the correlation is computed.

#### Unique Values, Value Counts, and Membership

In [225]:
# Another class of related methods extracts information about the values contained in a one-dimensional Series.
# Eg.
obj = pd.Series(["c", "a", "d", "a", "a", "b", "b", "c", "c"])

In [226]:
# The first function is unique, which gives you an array of the unique values in a Series
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [227]:
# The unique values are not necessarily returned in the order in which they first appear, and not in sorted order, but they could be sorted after the fact if needed (uniques.sort()).
# Relatedly, value_counts computes a Series containing value frequencies
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [228]:
# The Series is sorted by value in descending order as a convenience. value_counts is also available as a top-level pandas method that can be used with NumPy arrays or other Python sequences
pd.value_counts(obj.to_numpy(), sort=False)

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\1492743598.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(), sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [229]:
# isin performs a vectorized set membership check and can be useful in filtering a dataset down to a subset of values in a Series or column in a DataFrame
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [230]:
mask = obj.isin(["b", "c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [231]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [232]:
# the Index.get_indexer method is related to isin, which gives you an index array from an array of possibly nondistinct values into another array of distinct values
to_match = pd.Series(["c", "a", "b", "b", "c", "a"])
unique_vals = pd.Series(["c", "b", "a"])
indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [233]:
# Some cases may require computing a histogram on multiple related columns in a DataFrame.
data = pd.DataFrame({"Qu1": [1, 3, 4, 3, 4],
                     "Qu2": [2, 3, 1, 2, 3],
                     "Qu3": [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [234]:
# computing the value counts for a single column
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [235]:
# To compute this for all columns, pass pandas.value_counts to the DataFrame’s apply method
result = data.apply(pd.value_counts).fillna(0)
result

C:\Users\kanyi\AppData\Local\Temp\ipykernel_16132\3777204085.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [236]:
# the row labels in the result are the distinct values occurring in all of the columns.
# The values are the respective counts of these values in each column.

In [237]:
# DataFrame.value_counts method, computes counts considering each row of the DataFrame as a tuple to determine the number of occurrences of each distinct row
data = pd.DataFrame({"a": [1, 1, 1, 2, 2], "b": [0, 0, 1, 0, 0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [238]:
data.value_counts()

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64

In [239]:
# the result has an index representing the distinct rows as a hierarchical index